/*
*********************************************************************************************************
*
//LED1 -PB6--触发信号-放到EXT端
    //LED2-PB7 --波形信号 放到ad端  
*   
*********************************************************************************************************
*/

#include "bsp.h"			/* 底层硬件驱动 */
#include "demo_sd_fatfs.h"
int main(void)
{

	bsp_Init();							/* 硬件初始化 */
 
	while (1)
	{
        if(bsp_CheckTimer(1))
        {
           bsp_LedToggle(2);
          
        }

        if(bsp_CheckTimer(0))
        {
            bsp_StopTimer(1);
            bsp_LedOff(2);
            StartADC();	//再次开启ADC  开始下次采样
            
        }
	}
}







